-- MySQL dump 10.13  Distrib 9.0.1, for Linux (x86_64)
--
-- Host: localhost    Database: Canbo_store
-- ------------------------------------------------------
-- Server version	9.0.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Current Database: `Canbo_store`
--

/*!40000 DROP DATABASE IF EXISTS `Canbo_store`*/;

CREATE DATABASE /*!32312 IF NOT EXISTS*/ `Canbo_store` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;

USE `Canbo_store`;

--
-- Table structure for table `مواد شوینده`
--

DROP TABLE IF EXISTS `مواد شوینده`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `مواد شوینده` (
  `شعبه` varchar(8) DEFAULT NULL,
  `برند` varchar(7) DEFAULT NULL,
  `نام محصول` varchar(34) DEFAULT NULL,
  `مدل` varchar(15) DEFAULT NULL,
  `قیمت` varchar(6) DEFAULT NULL,
  `تعداد فروش` varchar(10) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `مواد شوینده`
--

LOCK TABLES `مواد شوینده` WRITE;
/*!40000 ALTER TABLE `مواد شوینده` DISABLE KEYS */;
INSERT INTO `مواد شوینده` VALUES /*('شعبه','برند','نام محصول','مدل','قیمت','تعداد فروش'),*/ ('مازندران','پریل','ژل ماشین ظرف شویی','1in3','250000','2310'),('مازندران','پریل','قرص ماشین ظرف شویی','Gold','250000','3600'),('مازندران','پریل','جرمگیر ماشین ظرف شویی','5X','200000','2700'),('مازندران','پریل','مایع ظرف شویی','پرتقال','185000','4700'),('مازندران','پریل','نمک ماشین ظرف شویی','معمولی','95000','3900'),('مازندران','پریل','مایع جلا دهنده ماشین ظرف شویی','معمولی','120000','3800'),('مازندران','پریل','مایع ظرف شویی','لوندر','170000','4500'),('مازندران','پریل','مایع ظرف شویی','Gold','250000','6700'),('مازندران','پریل','بوگیر ماشین ظرف شویی','DEO-DOU','200000','6300'),('قزوین','پریل','بوگیر ماشین ظرف شویی','Deo Perls Lemon','190000','8900'),('قزوین','پریل','مایع ظرف شویی','اکالیپتوس','185000','2300'),('قزوین','پریل','ژل ماشین ظرف شویی','Free Gold','200000','3200'),('قزوین','پریل','قرص ماشین ظرف شویی','All In One','220000','5600'),('قزوین','پریل','مایع ظرف شویی','Lemon','195000','6400'),('قزوین','دامستوس','مایع سفید کننده غلیظ سطوح','SnowWhite','54000','9000'),('قزوین','دامستوس','اسپری چند منظوره','Purple','93300','3200'),('قزوین','دامستوس','اسپری چند منظوره','Green','93000','4100'),('قزوین','دامستوس','مایع سفید کننده غلیظ','Lemon','55000','3950'),('قزوین','دامستوس','سفید کننده غلیظ سطوح','اکالیپتوس','50000','4900'),('قزوین','دامستوس','مایع سفید کننده غلیظ سطوح','Magnolia','55000','4850'),('قزوین','پرسیل','مایع لباس شویی','لاوندر','200000','5740'),('قزوین','پرسیل','مایع لباس شویی','ینیورسال','215000','4330'),('تهران','پرسیل','پودر ماشینی','یونیورسال','31000','3600'),('تهران','پرسیل','پودر ماشینی','معمولی','42000','5900'),('تهران','پرسیل','پودر ماشین لباس شویی','Premium','58700','4700'),('تهران','پرسیل','پودر لباس شویی','Premium','250000','6500'),('تهران','پرسیل','مایع لباس شویی','Premium','115000','6400'),('تهران','گلرنگ','مایع ظرف شویی','Lemon','150000','7100'),('تهران','گلرنگ','شامپو بچه','Pink','33000','5150'),('تهران','گلرنگ','مایع دست شویی','صدفی','162000','4250'),('تهران','گلرنگ','شامپو بچه','Blue','32200','3750'),('تهران','گلرنگ','شامپو بچه','Purple','32200','6440'),('تهران','گلرنگ','شیشه پاک کن قرمز','فاقد مدل','39100','2570'),('تهران','گلرنگ','شامپو بدن','Scrub Green','46600','8700'),('تهران','گلرنگ','اسپری گاز پاک کن','004\'','58900','2200'),('تهران','گلرنگ','شامپو بدن','Grape','64000','8750'),('تهران','گلرنگ','شامپو مولتی ویتامین مو معمولی','Wheat','40800','6300'),('اصفهان','پرژک','شامپو سیر','فاقد مدل','51710','8200'),('اصفهان','پرژک','شامپو ضد ریزش و ضد شوره','فاقد مدل','60000','9500'),('اصفهان','پرژک','شامپو گردو','فاقد مدل','60000','7900'),('اصفهان','پرژک','شامپو تقویت کننده و ترمیم کننده مو','Rice Extract','45000','4900'),('اصفهان','پرژک','شامپو روزانه مو','بابونه','46000','7950'),('اصفهان','پرژک','شامپو مو','Argan','68000','8000'),('اصفهان','پرژک','شامپو پرژک','انار','64000','8100'),('اصفهان','پرژک','شامپو پرژک','سدر','47000','7500'),('اصفهان','پرژک','نرم کننده مو','آرگان','95000','8240'),('اصفهان','پرژک','شامپو پرژک','فلفل','52000','9340'),('اصفهان','پرژک','شامپو تقویت کننده و ترمیم کننده مو','آرگان','136000','7750'),('اصفهان','پرژک','شامپو مو','سبوس برنج','184000','8540');
/*!40000 ALTER TABLE `مواد شوینده` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `مواد غذایی`
--

DROP TABLE IF EXISTS `مواد غذایی`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `مواد غذایی` (
  `شعبده` varchar(8) DEFAULT NULL,
  `برند` varchar(5) DEFAULT NULL,
  `نام محصول` varchar(22) DEFAULT NULL,
  `قیمت` varchar(6) DEFAULT NULL,
  `تعداد فروش` varchar(10) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `مواد غذایی`
--

LOCK TABLES `مواد غذایی` WRITE;
/*!40000 ALTER TABLE `مواد غذایی` DISABLE KEYS */;
INSERT INTO `مواد غذایی` VALUES /*('شعبه','برند','نام محصول','قیمت','تعداد فروش'),*/ ('مازندران','پگاه','ماست','15000','2650'),('مازندران','پگاه','ماست فاماس','25000','1500'),('مازندران','پگاه','ماست قفقازی','30000','1420'),('مازندران','پگاه','روغن کره','90000','5500'),('مازندران','پگاه','پنیر','40000','7120'),('مازندران','پگاه','کره پاستوریزه','45000','6530'),('مازندران','پگاه','خامه','20000','8700'),('مازندران','غنچه','روغن گیاهی نیمه جامد','261700','4560'),('مازندران','غنچه','روغن سرخکردنی','50000','7900'),('مازندران','غنچه','روغن جامد زیروترانس','250000','10545'),('مازندران','غنچه','روغن سه دانه','75000','3710'),('مازندران','غنچه','روغن زیتون','80000','3200'),('مازندران','غنچه','کره مارگارین','55000','2700'),('مازندران','غنچه','روغن نیمه جامد','10000','1100'),('مازندران','غنچه','روغن سرخکردنی','90000','2740'),('مازندران','غنچه','روغن آفتابگردان','85000','2670'),('مازندران','غنچه','روغن مایع','80000','1800'),('تهران','مزمز','بادام زمینی نمکی','20000','9000'),('تهران','مزمز','سوپر چیپس نمکی','25000','8200'),('تهران','مزمز','چیپس پیازی و جعفری','25000','4500'),('تهران','مزمز','بادام زمینی سرکه ای','20000','3700'),('تهران','مزمز','مغز تخمه آفتابگردان','15000','4620'),('تهران','مزمز','اسنک پنیزی','20000','3250'),('تهران','مزمز','تخمه آفتابگردان لیمویی','30000','1520'),('تهران','مزمز','چیپس فلفلی','20000','7900'),('تهران','مزمز','کیک وانیلی','20000','8900'),('تهران','مزمز','چیپس خلالی','20000','7230'),('تهران','مزمز','پسته','50000','1150'),('تهران','مزمز','بادام درختی نمکی','20000','4030'),('تهران','چیتوز','بیوگلز','25000','4500'),('تهران','چیتوز','بیسکوچی','15000','4365'),('تهران','چیتوز','چیفلکس','20000','5025'),('تهران','چیتوز','چیپلت','20000','6900'),('تهران','چیتوز','چی پف','15000','6925'),('تهران','چیتوز','آجیل','60000','3200'),('تهران','چیتوز','کراکر','15000','7035'),('تهران','چیتوز','اسنک','20000','4055'),('تهران','چیتوز','چیپس','20000','9200'),('اصفهان','کاله','پنیر موزارلا رشته ای','99500','3250'),('اصفهان','کاله','پنیر خامه ای ویلی','85000','4700'),('اصفهان','کاله','کره','55500','8900'),('اصفهان','کاله','پنیر لبنه آنا','75000','8920'),('اصفهان','کاله','خامه قنادی شیرین','93200','1200'),('اصفهان','کاله','سس انار','50000','4700'),('اصفهان','کاله','سوس گوجه فرنگی','55000','5620'),('اصفهان','کاله','سس مایونز','60000','6320'),('اصفهان','کاله','سس سالاد فرانسوی','70000','3740'),('اصفهان','کاله','پنیر پیتزا','63000','1600'),('اصفهان','کاله','پودر پنیر پارمسان','105000','2090');
/*!40000 ALTER TABLE `مواد غذایی` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `نوشیدنی ها`
--

DROP TABLE IF EXISTS `نوشیدنی ها`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `نوشیدنی ها` (
  `شعبه` varchar(8) DEFAULT NULL,
  `برند` varchar(9) DEFAULT NULL,
  `نام محصول` varchar(32) DEFAULT NULL,
  `قیمت` varchar(5) DEFAULT NULL,
  `تعداد فروش` varchar(10) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `نوشیدنی ها`
--

LOCK TABLES `نوشیدنی ها` WRITE;
/*!40000 ALTER TABLE `نوشیدنی ها` DISABLE KEYS */;
INSERT INTO `نوشیدنی ها` VALUES /*('شعبه','برند','نام محصول','قیمت','تعداد فروش'),*/ ('مازندران','عالیس','شیر کاکائو فرادما','25000','8900'),('مازندران','عالیس','شیر نارگیر فرادما','25000','7900'),('مازندران','عالیس','نوشابه گازدار با طعم کولا','30000','9550'),('مازندران','عالیس','نوشیدنی مالت عالیس با طعم کلاسیک','40000','6900'),('مازندران','عالیس','نوشیدنی مالت کلاسیک','35000','6800'),('مازندران','عالیس','نوشیدنی مالت عالیس با طعم قهوه','40000','7050'),('مازندران','عالیس','دوغ بدون گاز با طعم نعنا','40000','4500'),('مازندران','عالیس','دوغ بدون گاز هشت گیاه','42000','7530'),('مازندران','عالیس','نوشیدنی لیمو نعنا گازدار','41000','6540'),('مازندران','عالیس','شیر کمچرب فرادما','20000','9700'),('مازندران','عالیس','نوشابه گازدار  پرتقالی','30000','9800'),('اصفهان','کاله','شیر پرچرب','20000','3900'),('اصفهان','کاله','شیر کم چرب','39900','4100'),('اصفهان','کاله','شیر قهوه','40000','2560'),('اصفهان','کاله','شیر کاکاعو','30000','2670'),('اصفهان','کاله','شیر موز','20000','4370'),('اصفهان','کاله','دوکولا','25000','10700'),('اصفهان','کاله','نیوشابه','25000','11220'),('اصفهان','کاله','آب معدنی لاکی یو با طعم لیمو','29500','3900'),('اصفهان','کاله','شیر قهوه کاپوچینو','50000','3600'),('اصفهان','کاله','شیر بدون لاکتوز','59000','4300'),('اصفهان','کاله','شیر قهوه موکا سولاته','50000','6900'),('اصفهان','کاله','شیر پرچرب 955 میلی لیتر','43900','5940'),('اصفهان','کاله','شیر موز غنی شده','16500','4240'),('اصفهان','کاله','شیر کاکائو غنی شده','18700','5300'),('اصفهان','کاله','شیر قهوه اسپرسو','50000','5650'),('اصفهان','کاله','شیر کم چرب غنی شده','12000','4980'),('اصفهان','پگاه','شیر','20000','4900'),('اصفهان','پگاه','شیر خشک','30000','4550'),('تهران','پگاه','شیر گاومیش','70000','1320'),('تهران','پگاه','شیر کاکاعو فرادما','52000','7850'),('تهران','پگاه','شیر کامل','42000','7430'),('تهران','پگاه','شیرطالبی','14000','6930'),('تهران','پگاه','شیر موز فرادما','44000','9090'),('تهران','پگاه','شیر پرچرب','14500','8080'),('تهران','پگاه','شیر عسل','15000','6910'),('تهران','سان استار','آبمیوه انبه','23000','5000'),('تهران','سان استار','آبمیوه بلوبری و انار','78000','4300'),('تهران','سان استار','آبمیوه طبیعی','76000','6700'),('تهران','سان استار','نوشیدنی پرتغال','23000','7800'),('تهران','سان استار','نوشیدنی طبیعی موهیتو','66000','8640'),('تهران','سان استار','آبمیوه سیب','23000','5640'),('تهران','سان استار','آبمیوه یانگ بلوبری انار','78000','3900'),('تهران','سان استار','آبمیوه هلو','27000','7500'),('تهران','سان استار','آبمیوه لیمو','27000','8500'),('تهران','سان استار','آبمیوه پرتغال توسرخ','27000','9500'),('تهران','سان استار','آبمیوه میکس هندوانه و ملون','56000','5750'),('تهران','سان استار','آبمیوه چریکی','47000','6900'),('تهران','سان استار','نوشیدنی آلبالو','23000','7000');
/*!40000 ALTER TABLE `نوشیدنی ها` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping routines for database 'Canbo_store'
--
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-11-08  6:58:10
